RoDTOX/smart-aquarium-esp8266/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <ESP8266HTTPUpdateServer.h>
#include "Config.h"
#include "NetworkSync.h"
#include "RelayControl.h"

// Initialize the web server on port 80
ESP8266WebServer server(80);

// Initialize the OTA update server
ESP8266HTTPUpdateServer httpUpdater;

// Current system-wide operational mode
SystemMode currentSystemMode = MODE_DAY;

// Debounced power state for PIN_INPUT_GPIO0 (Power Sense)
static int debouncedPowerState = HIGH;

// Expanded Dashboard HTML in FLASH memory (PROGMEM)
const char DASHBOARD_HTML[] PROGMEM = R"rawhtml(
<!DOCTYPE html>
<html lang="ro">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Aquatlantis | Smart Aquarium</title>
    <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@300;400;600;800&display=swap" rel="stylesheet">
    <style>
        :root {
            --bg-base: #0b0f19;
            --bg-surface: #151d30;
            --bg-card: #1e2942;
            --text-primary: #f8fafc;
            --text-secondary: #94a3b8;
            --accent-primary: #38bdf8;
            --accent-primary-glow: rgba(56, 189, 248, 0.3);
            --state-ok: #10b981;
            --state-ok-glow: rgba(16, 185, 129, 0.3);
            --state-warn: #f59e0b;
            --state-warn-glow: rgba(245, 158, 11, 0.3);
            --state-danger: #ef4444;
            --state-danger-glow: rgba(239, 68, 68, 0.3);
            --border-color: rgba(255, 255, 255, 0.08);
        }
        
        * {
            box-sizing: border-box;
            margin: 0;
            padding: 0;
        }
        
        body {
            font-family: 'Outfit', sans-serif;
            background: radial-gradient(circle at 50% 0%, #1e2942 0%, var(--bg-base) 100%);
            color: var(--text-primary);
            padding: 24px 16px;
            display: flex;
            flex-direction: column;
            align-items: center;
            min-height: 100vh;
        }
        
        .container {
            max-width: 1000px;
            width: 100%;
            display: flex;
            flex-direction: column;
            gap: 24px;
        }
        
        header {
            display: flex;
            justify-content: space-between;
            align-items: center;
            background: linear-gradient(135deg, var(--bg-surface), var(--bg-card));
            padding: 20px 24px;
            border-radius: 16px;
            border: 1px solid var(--border-color);
            box-shadow: 0 4px 20px rgba(0,0,0,0.3);
            backdrop-filter: blur(12px);
            transition: box-shadow 0.2s;
        }
        
        header:hover {
            box-shadow: 0 6px 24px rgba(56, 189, 248, 0.08);
        }
        
        h1 {
            font-size: 24px;
            font-weight: 800;
            background: linear-gradient(to right, #38bdf8, #818cf8);
            -webkit-background-clip: text;
            -webkit-text-fill-color: transparent;
        }
        
        .sys-badge {
            display: flex;
            align-items: center;
            gap: 8px;
            font-size: 14px;
            font-weight: 600;
            padding: 6px 12px;
            border-radius: 9999px;
            background: rgba(255,255,255,0.05);
            border: 1px solid var(--border-color);
        }
        
        .status-dot {
            width: 10px;
            height: 10px;
            border-radius: 50%;
            display: inline-block;
        }
        
        @keyframes pulse-green {
            0% { box-shadow: 0 0 0 0 rgba(16, 185, 129, 0.4); }
            70% { box-shadow: 0 0 0 6px rgba(16, 185, 129, 0); }
            100% { box-shadow: 0 0 0 0 rgba(16, 185, 129, 0); }
        }
        @keyframes pulse-orange {
            0% { box-shadow: 0 0 0 0 rgba(245, 158, 11, 0.4); }
            70% { box-shadow: 0 0 0 6px rgba(245, 158, 11, 0); }
            100% { box-shadow: 0 0 0 0 rgba(245, 158, 11, 0); }
        }
        @keyframes pulse-red {
            0% { box-shadow: 0 0 0 0 rgba(239, 68, 68, 0.4); }
            70% { box-shadow: 0 0 0 6px rgba(239, 68, 68, 0); }
            100% { box-shadow: 0 0 0 0 rgba(239, 68, 68, 0); }
        }
        
        .dot-green { background-color: var(--state-ok); animation: pulse-green 2s infinite; }
        .dot-orange { background-color: var(--state-warn); animation: pulse-orange 2s infinite; }
        .dot-red { background-color: var(--state-danger); animation: pulse-red 2s infinite; }
        
        .main-layout {
            display: flex;
            flex-direction: row;
            gap: 20px;
            width: 100%;
            align-items: flex-start;
        }
        
        .layout-column {
            display: flex;
            flex-direction: column;
            gap: 20px;
        }
        
        .column-left {
            flex: 1.6; /* 60% width */
            min-width: 0;
        }
        
        .column-right {
            flex: 1.1; /* 40% width */
            min-width: 0;
        }
        
        @media(max-width: 850px) {
            .main-layout {
                flex-direction: column;
            }
            .column-left, .column-right {
                flex: none;
                width: 100%;
            }
        }
        
        .card {
            background: linear-gradient(135deg, var(--bg-surface), var(--bg-card));
            border-radius: 16px;
            border: 1px solid var(--border-color);
            padding: 20px;
            box-shadow: 0 4px 20px rgba(0,0,0,0.3);
            display: flex;
            flex-direction: column;
            gap: 16px;
            backdrop-filter: blur(12px);
            transition: box-shadow 0.2s, transform 0.2s;
        }
        
        .card:hover {
            box-shadow: 0 6px 24px rgba(56, 189, 248, 0.08);
        }
        
        .card-title {
            font-size: 18px;
            font-weight: 600;
            border-bottom: 1px solid var(--border-color);
            padding-bottom: 10px;
            color: var(--accent-primary);
            display: flex;
            align-items: center;
            justify-content: space-between;
        }
        
        .stat-row {
            display: flex;
            justify-content: space-between;
            align-items: center;
            padding: 8px 0;
            border-bottom: 1px solid rgba(255,255,255,0.03);
        }
        
        .stat-label {
            color: var(--text-secondary);
            font-size: 14px;
        }
        
        .stat-val {
            font-weight: 600;
            font-size: 14px;
        }
        
        .relay-item {
            background: var(--bg-card);
            border-radius: 10px;
            padding: 8px 10px;
            border: 1px solid var(--border-color);
            display: flex;
            flex-direction: column;
            gap: 6px;
        }
        
        .relay-header {
            display: flex;
            justify-content: space-between;
            align-items: center;
        }
        
