RoDTOX/smart-aquarium-esp8266/src/main.cpp
        .relay-name {
            font-weight: 600;
            font-size: 15px;
        }
        
        .relay-meta {
            display: flex;
            align-items: center;
            gap: 6px;
            font-size: 12px;
            color: var(--text-secondary);
        }
        
        .relay-controls {
            display: flex;
            gap: 8px;
            align-items: center;
            margin-top: 2px;
        }
        
        .btn {
            background: linear-gradient(135deg, #3b82f6, #1d4ed8);
            color: white;
            border: none;
            padding: 8px 16px;
            border-radius: 8px;
            font-family: inherit;
            font-weight: 600;
            cursor: pointer;
            transition: all 0.2s;
            font-size: 14px;
        }
        
        .btn:hover {
            opacity: 0.9;
            box-shadow: 0 0 10px rgba(59, 130, 246, 0.4);
            transform: translateY(-1px);
        }
        
        .btn:active {
            transform: translateY(1px);
        }
        
        .btn-secondary {
            background: rgba(255,255,255,0.08);
            color: var(--text-primary);
            border: 1px solid var(--border-color);
        }
        
        .btn-secondary:hover {
            background: rgba(255,255,255,0.15);
            box-shadow: none;
            transform: translateY(-1px);
        }
        
        .btn-danger {
            background: linear-gradient(135deg, #ef4444, #b91c1c);
        }
        
        .btn-danger:hover {
            box-shadow: 0 0 10px rgba(239, 68, 68, 0.4);
            transform: translateY(-1px);
        }
        
        .btn-sm {
            padding: 6px 12px;
            font-size: 12px;
            border-radius: 6px;
        }
        
        .compact-grid {
            display: grid;
            grid-template-columns: repeat(auto-fit, minmax(130px, 1fr));
            gap: 10px;
        }
        
        .stat-block {
            background: rgba(255, 255, 255, 0.02);
            border: 1px solid var(--border-color);
            padding: 8px 10px;
            border-radius: 8px;
            display: flex;
            flex-direction: column;
            gap: 2px;
            min-width: 0;
        }
        
        .stat-block .stat-label {
            font-size: 10px;
            color: var(--text-secondary);
            font-weight: 600;
            text-transform: uppercase;
            letter-spacing: 0.5px;
            overflow: hidden;
            text-overflow: ellipsis;
            white-space: nowrap;
        }
        
        .stat-block .stat-val {
            font-size: 13px;
            font-weight: 600;
            color: var(--text-primary);
        }
        
        .form-group {
            display: flex;
            flex-direction: column;
            gap: 6px;
        }
        
        label {
            font-size: 11px;
            color: var(--text-secondary);
            font-weight: 600;
            text-transform: uppercase;
            letter-spacing: 0.5px;
        }
        
        input[type="number"], input[type="text"], input[type="password"], select {
            background-color: var(--bg-card);
            border: 1px solid var(--border-color);
            padding: 10px;
            border-radius: 8px;
            color: white;
            font-family: inherit;
            font-size: 14px;
            outline: none;
            transition: border-color 0.2s;
            width: 100%;
        }
        
        select option {
            background-color: var(--bg-card);
            color: white;
        }
        
        input:focus, select:focus {
            border-color: var(--accent-primary);
        }
        
        .form-row {
            display: grid;
            grid-template-columns: 1fr 1fr;
            gap: 12px;
        }
        
        @media(max-width: 480px) {
            .form-row {
                grid-template-columns: 1fr;
            }
        }
        
        .toggle-switch {
            position: relative;
            display: inline-block;
            width: 48px;
            height: 24px;
        }
        
        .toggle-switch input {
            opacity: 0;
            width: 0;
            height: 0;
        }
        
        .slider {
            position: absolute;
            cursor: pointer;
            top: 0; left: 0; right: 0; bottom: 0;
            background-color: rgba(255,255,255,0.15);
            transition: .3s;
            border-radius: 24px;
        }
        
        .slider:before {
            position: absolute;
            content: "";
            height: 18px;
            width: 18px;
            left: 3px;
            bottom: 3px;
            background-color: white;
            transition: .3s;
            border-radius: 50%;
        }
        
        input:checked + .slider {
            background-color: var(--state-ok);
            box-shadow: 0 0 8px var(--state-ok-glow);
        }
        
        input:checked + .slider:before {
            transform: translateX(24px);
        }
        
        .toast {
            position: fixed;
            bottom: 20px;
            left: 50%;
            transform: translateX(-50%) translateY(100px);
            background-color: var(--bg-card);
            border: 1px solid var(--accent-primary);
            padding: 12px 24px;
            border-radius: 8px;
            box-shadow: 0 10px 25px rgba(0,0,0,0.5);
            transition: transform 0.3s ease;
            z-index: 1000;
            font-weight: 600;
        }
        
        .toast.show {
            transform: translateX(-50%) translateY(0);
        }
        
        .badge {
            font-size: 11px;
            padding: 3px 8px;
            border-radius: 4px;
            font-weight: bold;
            text-transform: uppercase;
        }
        
        .badge-auto { background: rgba(56, 189, 248, 0.15); color: var(--accent-primary); border: 1px solid rgba(56, 189, 248, 0.3); }
        .badge-manual { background: rgba(245, 158, 11, 0.15); color: var(--state-warn); border: 1px solid rgba(245, 158, 11, 0.3); }
        
        /* Timeline logger styles */
        .timeline-container {
            max-height: 250px;
            overflow-y: auto;
            display: flex;
            flex-direction: column;
            gap: 10px;
            padding-right: 4px;
        }
        
        .timeline-container::-webkit-scrollbar {
            width: 6px;
        }
        
        .timeline-container::-webkit-scrollbar-track {
            background: rgba(255, 255, 255, 0.01);
            border-radius: 4px;
        }
        
        .timeline-container::-webkit-scrollbar-thumb {
            background: var(--border-color);
            border-radius: 4px;
            transition: background 0.2s;
        }
        
        .timeline-container::-webkit-scrollbar-thumb:hover {
            background: var(--accent-primary);
        }
        
