RoDTOX/smart-aquarium-esp8266/src/main.cpp
        .timeline-item {
            border-left: 2px solid var(--accent-primary);
            padding-left: 12px;
            position: relative;
        }
        
        .timeline-item::before {
            content: '';
            width: 8px;
            height: 8px;
            border-radius: 50%;
            background-color: var(--accent-primary);
            position: absolute;
            left: -5px;
            top: 6px;
        }
        
        .timeline-time {
            font-size: 11px;
            color: var(--text-secondary);
            font-weight: 600;
        }
        
        .timeline-msg {
            font-size: 13px;
            margin-top: 2px;
        }
        
        /* Hour Grid Scheduler styles */
        .sched-relay-selector {
            background-color: var(--bg-card);
            border: 1px solid var(--border-color);
            padding: 10px;
            border-radius: 8px;
            color: white;
            font-family: inherit;
            font-weight: 600;
            width: auto;
        }
        
        .hour-grid {
            display: grid;
            grid-template-columns: repeat(12, 1fr);
            gap: 6px;
            margin-top: 10px;
        }
        
        @media(max-width: 480px) {
            .hour-grid {
                grid-template-columns: repeat(6, 1fr);
            }
        }
        
        .hour-cell {
            background-color: var(--bg-card);
            border: 1px solid var(--border-color);
            padding: 8px 4px;
            border-radius: 6px;
            font-size: 12px;
            font-weight: 600;
            text-align: center;
            cursor: pointer;
            transition: all 0.2s;
            user-select: none;
        }
        
        .hour-cell:hover {
            border-color: var(--accent-primary);
        }
        
        .hour-cell.active {
            background-color: var(--accent-primary);
            color: var(--bg-base);
            box-shadow: 0 0 8px var(--accent-primary-glow);
            border-color: var(--accent-primary);
        }
        
        footer {
            text-align: center;
            font-size: 12px;
            color: var(--text-secondary);
            margin-top: auto;
            padding: 20px 0;
        }
    </style>
</head>
<body>
    <div class="container">
        <header>
            <div>
                <h1>Aquatlantis</h1>
                <p style="font-size: 12px; color: var(--text-secondary)">Smart Aquarium Controller | BioBox 56L</p>
            </div>
            <div class="sys-badge" id="wifi-badge">
                <span class="status-dot dot-green" id="wifi-dot"></span>
                <span id="wifi-status-text">Conectat</span>
            </div>
        </header>

        <div class="main-layout">
            <!-- Left Column (Wider): Stare Sistem, Intrări Digitale, Planificator -->
            <div class="layout-column column-left">
                <!-- Stare Sistem -->
                <div class="card">
                    <div class="card-title">
                        Stare Sistem
                        <span class="status-dot dot-green" id="system-dot"></span>
                    </div>
                    <div class="compact-grid">
                        <div class="stat-block">
                            <span class="stat-label">Mod Operare</span>
                            <span class="stat-val" id="mode-val">MOD NORMAL - ZI</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">Ceas (NTP Sync)</span>
                            <span class="stat-val" id="time-val">00:00:00</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">Uptime</span>
                            <span class="stat-val" id="uptime-val">0s</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">WiFi SSID</span>
                            <span class="stat-val" id="ssid-val">-</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">Semnal RSSI</span>
                            <span class="stat-val" id="rssi-val">-99 dBm</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">Adresă IP</span>
                            <span class="stat-val" id="ip-val">192.168.1.32</span>
                        </div>
                    </div>
                </div>

                <!-- Intrări Digitale (Senzori) -->
                <div class="card">
                    <div class="card-title">Intrări Digitale (Senzori)</div>
                    <div class="compact-grid">
                        <div class="stat-block">
                            <span class="stat-label">GPIO 0 (Senzor Alimentare)</span>
                            <span class="stat-val" id="input-gpio0"><span class="status-dot dot-orange"></span> Se încarcă...</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">GPIO 4 (Liber)</span>
                            <span class="stat-val" id="input-gpio4"><span class="status-dot dot-orange"></span> Se încarcă...</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">GPIO 2 (Liber)</span>
                            <span class="stat-val" id="input-gpio2"><span class="status-dot dot-orange"></span> Se încarcă...</span>
                        </div>
                        <div class="stat-block">
                            <span class="stat-label">GPIO 15 (Liber)</span>
                            <span class="stat-val" id="input-gpio15"><span class="status-dot dot-orange"></span> Se încarcă...</span>
                        </div>
                    </div>
                </div>

