RoDTOX/smart-aquarium-esp8266/src/main.cpp
                <!-- Planificator 24H (Scheduler) -->
                <div class="card">
                    <div class="card-title">
                        Configurare Orar Avansat (24h)
                        <select id="relay-select" class="sched-relay-selector" onchange="onRelaySelected(this.value)">
                            <option value="1">Releu 1: Iluminat Principal</option>
                            <option value="2">Releu 2: Electrovalvă CO2</option>
                            <option value="3">Releu 3: Pompă de Aer</option>
                            <option value="4">Releu 4: Iluminat Ambiental</option>
                        </select>
                    </div>
                    
                    <div style="display: flex; flex-direction: column; gap: 12px;">
                        <label>Alege orele active de funcționare (00-23):</label>
                        <div class="hour-grid" id="hour-grid">
                            <!-- Hour cells will be inserted here dynamically -->
                        </div>
                    </div>

                    <div class="form-row" style="margin-top: 8px;">
                        <div class="form-group">
                            <label for="relay-behavior">Comportament Activ</label>
                            <select id="relay-behavior" onchange="onBehaviorChanged(this.value)">
                                <option value="0">Continuu (Întotdeauna Pornit)</option>
                                <option value="1">Intermitent (Pulse Mode)</option>
                            </select>
                        </div>
                        <div class="form-row" id="pulse-settings-row">
                            <div class="form-group">
                                <label for="relay-pulse-on">Pompă ON (secunde)</label>
                                <input type="number" id="relay-pulse-on" min="1" max="3600" value="60">
                            </div>
                            <div class="form-group">
                                <label for="relay-pulse-off">Pompă OFF (secunde)</label>
                                <input type="number" id="relay-pulse-off" min="1" max="3600" value="120">
                            </div>
                        </div>
                    </div>
                    
                    <button class="btn" onclick="saveRelaySchedule()">Salvează Programul Releului</button>
                    
                    <!-- Preseturi & Administrare -->
                    <div style="border-top: 1px solid var(--border-color); padding-top: 16px; margin-top: 16px; display: flex; flex-direction: column; gap: 12px;">
                        <label>Preseturi & Administrare Programe</label>
                        <div style="display: flex; gap: 12px; align-items: center; flex-wrap: wrap;">
                            <select id="preset-select" style="flex: 1; min-width: 200px;">
                                <option value="1">Preset 1: Standard Aquatlantis (Lumină, CO2, Ambient, Aer Nocturn)</option>
                                <option value="2">Preset 2: Control Alge (Lumină Redusă, CO2 Redus, Aer Extins)</option>
                                <option value="3">Preset 3: Mentenanță/Tratament (Fără Lumini, Aer permanent 24h)</option>
                            </select>
                            <button class="btn btn-sm" onclick="applyPreset()">Aplică Preset</button>
                            <button class="btn btn-sm btn-danger" onclick="resetToDefaults()" style="background: linear-gradient(135deg, #ef4444, #b91c1c); border: none;">Resetare Fabrică</button>
                        </div>
                    </div>
                </div>
            </div>

            <!-- Right Column (Narrower): Control Periferice, WiFi Config -->
            <div class="layout-column column-right">
                <!-- Control Periferice -->
                <div class="card">
                    <div class="card-title">Control Periferice</div>
                    <div id="relays-container" style="display: flex; flex-direction: column; gap: 12px;">
                        <!-- Relays will be inserted here dynamically -->
                    </div>
                    <button class="btn btn-secondary btn-sm" onclick="clearOverrides()" style="margin-top: 8px;">Revenire la Auto (Toate)</button>
                </div>

                <!-- WiFi Config -->
                <div class="card">
                    <div class="card-title">Configurare WiFi</div>
                    <div class="form-row">
                        <div class="form-group">
                            <label for="wifi-ssid">SSID Rețea</label>
                            <input type="text" id="wifi-ssid" placeholder="Nume rețea locală">
                        </div>
                        <div class="form-group">
                            <label for="wifi-pass">Parolă</label>
                            <input type="password" id="wifi-pass" placeholder="••••••••">
                        </div>
                    </div>
                    <button class="btn" onclick="saveWifi()">Conectează Dispozitivul</button>
                </div>
            </div>
        </div>

        <!-- Istoric Evenimente (Timeline) - Full Width at bottom -->
        <div class="card" style="margin-top: 20px;">
            <div class="card-title">Istoric Evenimente (Timeline)</div>
            <div class="timeline-container" id="timeline-container">
                <p style="font-size: 13px; color: var(--text-secondary)">Se încarcă istoricul...</p>
            </div>
        </div>
        
        <footer>
            Aquatlantis Smart Aquarium Controller • ESP8266 ESP-12F • Otopeni, România
        </footer>
    </div>

    <div class="toast" id="toast">Setări salvate cu succes!</div>

    <script>
        // Local state of schedules loaded from API
        let schedules = [];

        function showToast(msg) {
            const t = document.getElementById('toast');
            t.innerText = msg;
            t.classList.add('show');
            setTimeout(() => t.classList.remove('show'), 3000);
        }

        function formatUptime(sec) {
            const h = Math.floor(sec / 3600);
            const m = Math.floor((sec % 3600) / 60);
            const s = sec % 60;
            return `${h}h ${m}m ${s}s`;
        }

        // Initialize 24 hour grid cells
        function initHourGrid() {
            const grid = document.getElementById('hour-grid');
            grid.innerHTML = '';
            for (let i = 0; i < 24; i++) {
                const cell = document.createElement('div');
                cell.className = 'hour-cell';
                cell.innerText = i.toString().padStart(2, '0');
                cell.dataset.hour = i;
                cell.onclick = () => {
                    cell.classList.toggle('active');
                };
                grid.appendChild(cell);
            }
        }

