RoDTOX/smart-aquarium-esp8266/src/main.cpp
        function onRelaySelected(relayNum) {
            const sched = schedules.find(s => s.num == relayNum);
            if (!sched) return;

            // Load behavior
            document.getElementById('relay-behavior').value = sched.behavior;
            onBehaviorChanged(sched.behavior);

            // Load pulse settings
            document.getElementById('relay-pulse-on').value = sched.pulse_on;
            document.getElementById('relay-pulse-off').value = sched.pulse_off;

            // Load hours bitmap
            const cells = document.querySelectorAll('.hour-cell');
            cells.forEach(cell => {
                const hr = parseInt(cell.dataset.hour);
                const isActive = (sched.active_hours & (1 << hr)) !== 0;
                if (isActive) {
                    cell.classList.add('active');
                } else {
                    cell.classList.remove('active');
                }
            });
        }

        function onBehaviorChanged(val) {
            const row = document.getElementById('pulse-settings-row');
            if (val == "1") {
                row.style.display = 'grid';
            } else {
                row.style.display = 'none';
            }
        }

        async function fetchHistory() {
            try {
                const res = await fetch('/api/history');
                const data = await res.json();
                const container = document.getElementById('timeline-container');
                container.innerHTML = '';
                
                if (data.length === 0) {
                    container.innerHTML = '<p style="font-size: 13px; color: var(--text-secondary)">Nu există loguri încă.</p>';
                    return;
                }
                
                data.reverse().forEach(event => {
                    const item = document.createElement('div');
                    item.className = 'timeline-item';
                    item.innerHTML = `
                        <div class="timeline-time">${event.time}</div>
                        <div class="timeline-msg">${event.msg}</div>
                    `;
                    container.appendChild(item);
                });
            } catch (err) {
                console.error("Error fetching history:", err);
            }
        }

        async function fetchSchedules() {
            try {
                const res = await fetch('/api/schedule');
                schedules = await res.json();
                // Refresh currently selected relay schedule in grid
                const currentRelay = document.getElementById('relay-select').value;
                onRelaySelected(currentRelay);
            } catch (err) {
                console.error("Error fetching schedules:", err);
            }
        }

        async function fetchStatus() {
            try {
                const res = await fetch('/api/status');
                const data = await res.json();
                
                // Update stats
                document.getElementById('mode-val').innerText = data.mode;
                document.getElementById('time-val').innerText = data.time;
                document.getElementById('uptime-val').innerText = formatUptime(data.uptime);
                document.getElementById('ssid-val').innerText = data.wifi_ssid;
                document.getElementById('rssi-val').innerText = data.wifi_rssi + ' dBm';
                document.getElementById('ip-val').innerText = data.ip;
                
                // Update Digital Inputs
                const updateInputDot = (id, state) => {
                    const el = document.getElementById(id);
                    if (state) {
                        el.innerHTML = '<span class="status-dot dot-green"></span> HIGH (3.3V)';
                    } else {
                        el.innerHTML = '<span class="status-dot dot-red"></span> LOW (GND)';
                    }
                };
                updateInputDot('input-gpio0', data.inputs.gpio0);
                updateInputDot('input-gpio4', data.inputs.gpio4);
                updateInputDot('input-gpio2', data.inputs.gpio2);
                updateInputDot('input-gpio15', data.inputs.gpio15);
                
                // System operational dot
                const sysDot = document.getElementById('system-dot');
                sysDot.className = 'status-dot';
                if (data.mode_id === 0) sysDot.classList.add('dot-green'); // Day
                else if (data.mode_id === 1) sysDot.classList.add('dot-orange'); // Night
                else if (data.mode_id === 2) sysDot.classList.add('dot-red'); // Power Loss
                
                // WiFi badge
                const wifiBadge = document.getElementById('wifi-badge');
                const wifiDot = document.getElementById('wifi-dot');
                const wifiText = document.getElementById('wifi-status-text');
                wifiText.innerText = data.wifi_status;
                wifiDot.className = 'status-dot';
                if (data.wifi_status === 'Connected') {
                    wifiDot.classList.add('dot-green');
                } else {
                    wifiDot.classList.add('dot-red');
                }
                
                // Relays list
                const container = document.getElementById('relays-container');
                container.innerHTML = '';
                
                data.relays.forEach(relay => {
                    const item = document.createElement('div');
                    item.className = 'relay-item';
                    
                    const badgeClass = relay.override ? 'badge-manual' : 'badge-auto';
                    const badgeText = relay.override ? 'Manual' : 'Auto';
                    const stateDotClass = relay.state ? 'dot-green' : 'dot-red';
                    const stateText = relay.state ? 'PORNIT' : 'OPRIT';
                    
                    item.innerHTML = `
                        <div class="relay-header">
                            <div>
                                <span class="relay-name">${relay.name}</span>
                                <div class="relay-meta">Releu ${relay.num} (GPIO ${relay.num === 1 ? 16 : relay.num === 2 ? 14 : relay.num === 3 ? 12 : 13})</div>
                            </div>
                            <div style="text-align: right;">
                                <span class="badge ${badgeClass}">${badgeText}</span>
                                <div style="font-size: 11px; margin-top: 4px; display: flex; align-items: center; gap: 4px; justify-content: flex-end;">
                                    <span class="status-dot ${stateDotClass}"></span> ${stateText}
                                </div>
                            </div>
                        </div>
                        <div class="relay-controls">
                            <button class="btn btn-sm btn-secondary ${relay.override ? 'btn-danger' : ''}" onclick="toggleOverride(${relay.num}, ${relay.override ? 0 : 1})">
                                ${relay.override ? 'Eliberează Auto' : 'Forțează Manual'}
                            </button>
                            <label class="toggle-switch" style="visibility: ${relay.override ? 'visible' : 'hidden'}">
                                <input type="checkbox" ${relay.state ? 'checked' : ''} onchange="toggleState(${relay.num}, this.checked ? 1 : 0)">
                                <span class="slider"></span>
                            </label>
                        </div>
                    `;
                    container.appendChild(item);
                });
                
            } catch (err) {
                console.error("Error fetching status:", err);
            }
        }

        async function toggleOverride(num, override) {
            try {
                const res = await fetch('/api/override', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: `relay=${num}&override=${override}`
                });
                if (res.ok) {
                    showToast(override ? `Forțare manuală activată pentru Releu ${num}` : `Releu ${num} redat controlului automat`);
                    fetchStatus();
                    fetchHistory();
                }
            } catch (err) {
                showToast("Eroare de comunicare!");
            }
        }

        async function toggleState(num, state) {
            try {
                const res = await fetch('/api/override', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: `relay=${num}&override=1&state=${state}`
                });
                if (res.ok) {
                    showToast(`Releu ${num} setat pe ${state ? 'PORNIT' : 'OPRIT'}`);
                    fetchStatus();
                    fetchHistory();
                }
            } catch (err) {
                showToast("Eroare de comunicare!");
            }
        }

