RoDTOX/smart-aquarium-esp8266/src/main.cpp
        async function clearOverrides() {
            try {
                const res = await fetch('/api/override', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: 'clear=1'
                });
                if (res.ok) {
                    showToast("Toate releele au revenit în mod automat.");
                    fetchStatus();
                    fetchHistory();
                }
            } catch (err) {
                showToast("Eroare de comunicare!");
            }
        }

        async function saveRelaySchedule() {
            const relayNum = document.getElementById('relay-select').value;
            const behavior = document.getElementById('relay-behavior').value;
            const pulseOn = document.getElementById('relay-pulse-on').value;
            const pulseOff = document.getElementById('relay-pulse-off').value;

            // Calculate hours bitmap
            let bitmap = 0;
            const cells = document.querySelectorAll('.hour-cell');
            cells.forEach(cell => {
                if (cell.classList.contains('active')) {
                    const hr = parseInt(cell.dataset.hour);
                    bitmap |= (1 << hr);
                }
            });

            try {
                const res = await fetch('/api/schedule', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: `relay=${relayNum}&active_hours=${bitmap}&behavior=${behavior}&pulse_on=${pulseOn}&pulse_off=${pulseOff}`
                });
                if (res.ok) {
                    showToast(`Orarul Releului ${relayNum} a fost salvat!`);
                    await fetchSchedules();
                    await fetchHistory();
                } else {
                    showToast("Eroare la salvarea orarului!");
                }
            } catch (err) {
                showToast("Eroare de comunicare!");
            }
        }

        async function saveWifi() {
            const ssid = document.getElementById('wifi-ssid').value;
            const pass = document.getElementById('wifi-pass').value;
            
            if (!ssid) {
                showToast("SSID-ul nu poate fi gol!");
                return;
            }
            
            try {
                showToast("Se trimit credențialele. Dispozitivul va încerca reconectarea...");
                fetch('/api/wifi', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: `ssid=${encodeURIComponent(ssid)}&pass=${encodeURIComponent(pass)}`
                });
            } catch (err) {
                showToast("Eroare de trimitere!");
            }
        }

        async function applyPreset() {
            const pNum = document.getElementById('preset-select').value;
            if (!confirm(`Sigur dorești să aplici Presetul ${pNum}? Aceasta va suprascrie orarul actual al releelor.`)) {
                return;
            }
            try {
                const res = await fetch('/api/presets', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: `apply=${pNum}`
                });
                if (res.ok) {
                    showToast("Preset aplicat cu succes!");
                    await fetchSchedules();
                    await fetchStatus();
                    await fetchHistory();
                } else {
                    showToast("Eroare la aplicarea presetului!");
                }
            } catch (err) {
                showToast("Eroare de comunicare!");
            }
        }

        async function resetToDefaults() {
            if (!confirm("Sigur dorești să resetezi toate releele la setările din fabrică?")) {
                return;
            }
            try {
                const res = await fetch('/api/presets', {
                    method: 'POST',
                    headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
                    body: 'reset=1'
                });
                if (res.ok) {
                    showToast("Programe resetate la setările din fabrică!");
                    await fetchSchedules();
                    await fetchStatus();
                    await fetchHistory();
                } else {
                    showToast("Eroare la resetarea programelor!");
                }
            } catch (err) {
                showToast("Eroare de comunicare!");
            }
        }

        // Initialize UI components
        initHourGrid();

        // Initial Data Loads
        fetchStatus();
        fetchSchedules();
        fetchHistory();

        // Polling updates (every 2 seconds)
        setInterval(() => {
            fetchStatus();
            fetchHistory();
        }, 2000);
    </script>
</body>
</html>
)rawhtml";

// Serve Dashboard HTML page from Flash memory
void handleRoot() {
    server.send_P(200, "text/html", DASHBOARD_HTML);
}

// REST API endpoint: Returns system status and states as JSON
void handleStatus() {
    String r = "{";
    r += "\"mode\":\"" + getModeString(currentSystemMode) + "\",";
    r += "\"mode_id\":" + String((int)currentSystemMode) + ",";
    r += "\"inputs\":{";
    r += "\"gpio0\":" + String(debouncedPowerState == HIGH ? "true" : "false") + ",";
    r += "\"gpio4\":" + String(digitalRead(PIN_INPUT_GPIO4) == HIGH ? "true" : "false") + ",";
    r += "\"gpio2\":" + String(digitalRead(PIN_INPUT_GPIO2) == HIGH ? "true" : "false") + ",";
    r += "\"gpio15\":" + String(digitalRead(PIN_INPUT_GPIO15) == HIGH ? "true" : "false");
    r += "},";
    r += "\"time\":\"" + getFormattedTime() + "\",";
    r += "\"wifi_ssid\":\"" + getWiFiSSID() + "\",";
    r += "\"wifi_rssi\":" + String(getWiFiRSSI()) + ",";
    r += "\"wifi_status\":\"" + getNetworkStatusString() + "\",";
    r += "\"ip\":\"" + getIPAddress() + "\",";
    r += "\"uptime\":" + String(millis() / 1000) + ",";
    r += "\"relays\":[";
    for (int i = 1; i <= 4; i++) {
        RelayState s = getRelayState(i);
        String name;
        switch(i) {
            case 1: name = "Iluminat Principal"; break;
            case 2: name = "Electrovalva CO2"; break;
            case 3: name = "Pompa de Aer"; break;
            case 4: name = "Iluminat Ambiental"; break;
            default: name = "Releu"; break;
        }
        r += "{";
        r += "\"num\":" + String(i) + ",";
        r += "\"name\":\"" + name + "\",";
        r += "\"state\":" + String(s.physicalState ? "true" : "false") + ",";
        r += "\"override\":" + String(s.manualOverride ? "true" : "false") + ",";
        r += "\"override_state\":" + String(s.manualState ? "true" : "false");
        r += "}";
        if (i < 4) r += ",";
    }
    r += "]";
    r += "}";
    server.send(200, "application/json", r);
}

