RoDTOX/smart-aquarium-esp8266/src/main.cpp
    // 4. Web requests handler
    server.handleClient();
    
    // 5. Periodic serial logger (every 5 seconds) to aid deployment diagnostics
    static unsigned long lastLogTime = 0;
    if (millis() - lastLogTime >= 5000) {
        lastLogTime = millis();
        
        Serial.printf("\n[LOG] Time: %s | Mode: %s | WiFi: %s | IP: %s\n",
                      getFormattedTime().c_str(),
                      getModeString(currentSystemMode).c_str(),
                      getNetworkStatusString().c_str(),
                      getIPAddress().c_str());
                      
        Serial.printf("      Inputs: GPIO0:%d | GPIO4:%d | GPIO2:%d | GPIO15:%d\n",
                      digitalRead(PIN_INPUT_GPIO0),
                      digitalRead(PIN_INPUT_GPIO4),
                      digitalRead(PIN_INPUT_GPIO2),
                      digitalRead(PIN_INPUT_GPIO15));
                      
        for (int i = 1; i <= 4; i++) {
            RelayState s = getRelayState(i);
            RelayProfile p = getRelayProfile(i);
            String modeStr = s.manualOverride ? "MANUAL" : "AUTO";
            String behaviorStr = p.behavior == 1 ? "PULSE (" + String(p.pulseOnSec) + "s/" + String(p.pulseOffSec) + "s)" : "CONTINUOUS";
            
            // Format active hours bitmap to intervals
            String activeHoursStr = "";
            int start = -1;
            for (int h = 0; h < 24; h++) {
                bool active = (p.activeHours & (1UL << h)) != 0;
                if (active) {
                    if (start == -1) start = h;
                } else {
                    if (start != -1) {
                        if (activeHoursStr.length() > 0) activeHoursStr += ",";
                        if (start == h - 1) activeHoursStr += String(start);
                        else activeHoursStr += String(start) + "-" + String(h - 1);
                        start = -1;
                    }
                }
            }
            if (start != -1) {
                if (activeHoursStr.length() > 0) activeHoursStr += ",";
                if (start == 23) activeHoursStr += "23";
                else activeHoursStr += String(start) + "-23";
            }
            if (activeHoursStr.length() == 0) activeHoursStr = "None";
            
            Serial.printf("      Relay %d: %s | Mode: %s | Behavior: %s | Sched: [%s]\n",
                          i,
                          s.physicalState ? "ON" : "OFF",
                          modeStr.c_str(),
                          behaviorStr.c_str(),
                          activeHoursStr.c_str());
        }
        Serial.println("-----------------------------------------------------------------");
    }
    
    // Tiny delay to yield to the ESP8266 background processes (prevent watchdog timeouts)
    delay(5);
}
